app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins" ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "pins"
---
  def index
    @pins = Pin.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 8)

INSERT INTO "pins" ("created_at", "description", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Tue, 11 Nov 2014 19:55:47 UTC +00:00], ["description", "This pin should have a user"], ["updated_at", Tue, 11 Nov 2014 19:55:47 UTC +00:00], ["user_id", 1]]
---
  def create
    @pin = current_user.pins.build(pin_params)
    if @pin.save

UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = 1  [["description", "This is my first Pin"], ["updated_at", Tue, 11 Nov 2014 18:37:43 UTC +00:00]]
---
  def update
    if @pin.update(pin_params)